In [10]:
#Import dependencis 
import pandas as pd
import matplotlib as plt
import sqlalchemy
from sqlalchemy import create_engine, func
import psycopg2

In [11]:
#create SQL Engine
user = "postgres"
pw = "postgres"
engine = create_engine(f"postgresql://{user}:{pw}@localhost:5432/Pewlett_Hackard")
conn = engine.connect()

In [17]:
#SQL statement 
sql = "SELECT e.emp_no, s.salary " 
sql = sql + "FROM employees AS e "
sql = sql + "JOIN salaries AS s ON " 
sql = sql + "e.emp_no = s.emp_no "
sql = sql + "GROUP BY 1, 2 "
sql = sql + "ORDER BY 2 DESC;"

data = conn.execute(sql)

emp_data = pd.read_sql(sql,conn)

emp_df = pd.DataFrame(emp_data)

emp_df.describe()

              emp_no         salary
count  300024.000000  300024.000000
mean   253321.763392   52970.732451
std    161828.235540   14301.478491
min     10001.000000   40000.000000
25%     85006.750000   40000.000000
50%    249987.500000   48681.000000
75%    424993.250000   61758.000000
max    499999.000000  129492.000000

In [22]:
#Create bin, for employee salaries
salary_bin = ['0 to 40k','41k to 70k','71k to 100k','101k to 120k','121k +']

emp_df['bin'] = pd.cut(emp_df.salary,5,labels=salary_bin)
emp_df

        emp_no  salary       bin
0       205000  129492    121k +
1        44188  127238    121k +
2       444756  127041    121k +
3       458302  126703    121k +
4        37558  125469    121k +
5       296857  124357    121k +
6        20004  123749    121k +
7       109334  123668    121k +
8       474456  123477    121k +
9       474684  122726    121k +
10      267005  122423    121k +
11      238117  121617    121k +
12       48571  121468    121k +
13      406747  121393    121k +
14      258777  121070    121k +
15       14523  121038    121k +
16       33701  120986    121k +
17       25472  120775    121k +
18      400122  120532    121k +
19       39964  120487    121k +
20       28301  120446    121k +
21      493158  120253    121k +
22      276633  120127    121k +
23       98169  120032    121k +
24      412164  119939    121k +
25      106201  119925    121k +
26      237674  119370    121k +
27       84659  119159    121k +
28      298888  119159    121k +
29       46439  119124    121k +
...        ...     ...       ...
299994  499916   40000  0 to 40k
299995  499917   40000  0 to 40k
299996  499921   40000  0 to 40k
299997  499924   40000  0 to 40k
299998  499929   40000  0 to 40k
299999  499933   40000  0 to 40k
300000  499936   40000  0 to 40k
300001  499937   40000  0 to 40k
300002  499942   40000  0 to 40k
300003  499943   40000  0 to 40k
300004  499944   40000  0 to 40k
300005  499948   40000  0 to 40k
300006  499951   40000  0 to 40k
300007  499954   40000  0 to 40k
300008  499956   40000  0 to 40k
300009  499957   40000  0 to 40k
300010  499961   40000  0 to 40k
300011  499973   40000  0 to 40k
300012  499974   40000  0 to 40k
300013  499975   40000  0 to 40k
300014  499978   40000  0 to 40k
300015  499982   40000  0 to 40k
300016  499983   40000  0 to 40k
300017  499984   40000  0 to 40k
300018  499985   40000  0 to 40k
300019  499990   40000  0 to 40k
300020  499993   40000  0 to 40k
300021  499994   40000  0 to 40k
300022  499995   40000  0 to 40k
300023  499998   40000  0 to 40k

[300024 rows x 3 columns]